#cd D:python/python/15
#153.py
#Напишите дружественную функцию для обработки объекта типа фирма.

#Дружественная функция — это функция, 
#которая имеет доступ к закрытым членам класса, 
#как если бы она сама была членом этого класса. 
#Во всех других отношениях дружественная функция 
#является обычной функцией. Ею может быть, 
#как обычная функция, так и метод другого класса. 
#Для объявления дружественной функции используется 
#ключевое слово friend перед прототипом функции, 
#которую вы хотите сделать дружественной классу. 
#Неважно, объявляете ли вы её в public- или в private-зоне класса.
